03_Simulation/TESTCASES/0.BASELINE/DATA/BoR_SST/SST_MediumBody/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  ==========
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(    (-3.771236166328 0.000000000000 0.000000000000) //vertex 0
    (0.000000000000 0.000000000000 0.000000000000) //vertex 1
    (-0.250000000000 0.999048221582 -0.043619387365) //vertex 2
    (-3.771236166328 0.999048221582 -0.043619387365) //vertex 3
    (-0.250000000000 0.999048221582 0.043619387365) //vertex 4
    (-3.771236166328 0.999048221582 0.043619387365) //vertex 5
    (2.666666666667 0.470955848142 -0.020562376398) //vertex 6
    (2.666666666667 0.999048221582 -0.043619387365) //vertex 7
    (2.666666666667 0.470955848142 0.020562376398) //vertex 8
    (2.666666666667 0.999048221582 0.043619387365) //vertex 9
    (10.000000000000 0.470955848142 -0.020562376398) //vertex 10
    (10.000000000000 0.999048221582 -0.043619387365) //vertex 11
    (10.000000000000 0.470955848142 0.020562376398) //vertex 12
    (10.000000000000 0.999048221582 0.043619387365) //vertex 13
    (12.666666666667 0.000000000000 0.000000000000) //vertex 14
    (12.766666666667 0.999048221582 -0.043619387365) //vertex 15
    (12.766666666667 0.999048221582 0.043619387365) //vertex 16
    (20.209138999323 0.000000000000 0.000000000000) //vertex 17
    (20.209138999323 0.999048221582 -0.043619387365) //vertex 18
    (20.209138999323 0.999048221582 0.043619387365) //vertex 19
);

blocks
(
    hex (0 1 2 3 0 1 4 5)
    (226 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (1 6 7 2 1 8 9 4)
    (160 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (6 10 11 7 8 12 13 9)
    (440 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (10 14 15 11 12 14 16 13)
    (160 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
    hex (14 17 18 15 14 17 19 16)
    (453 380 1)
    simpleGrading
    (
        1
        (
            (30 30 1.000000)
            (170 60 3.000000)
            (1304 100 3.000000)
            (1304 100 0.333333)
            (170 60 0.333333)
            (30 30 1.000000)
        )
        1
    )
);

edges
(
    spline 1 4
    (
    (-0.019407960000 0.019980964432 0.000872387747)
    (-0.037663360000 0.039961928863 0.001744775495)
    (-0.054812760000 0.059942893295 0.002617163242)
    (-0.070901760000 0.079923857727 0.003489550989)
    (-0.085975000000 0.099904822158 0.004361938737)
    (-0.100076160000 0.119885786590 0.005234326484)
    (-0.113247960000 0.139866751021 0.006106714231)
    (-0.125532160000 0.159847715453 0.006979101978)
    (-0.136969560000 0.179828679885 0.007851489726)
    (-0.147600000000 0.199809644316 0.008723877473)
    (-0.157462360000 0.219790608748 0.009596265220)
    (-0.166594560000 0.239771573180 0.010468652968)
    (-0.175033560000 0.259752537611 0.011341040715)
    (-0.182815360000 0.279733502043 0.012213428462)
    (-0.189975000000 0.299714466475 0.013085816210)
    (-0.196546560000 0.319695430906 0.013958203957)
    (-0.202563160000 0.339676395338 0.014830591704)
    (-0.208056960000 0.359657359769 0.015702979452)
    (-0.213059160000 0.379638324201 0.016575367199)
    (-0.217600000000 0.399619288633 0.017447754946)
    (-0.221708760000 0.419600253064 0.018320142693)
    (-0.225413760000 0.439581217496 0.019192530441)
    (-0.228742360000 0.459562181928 0.020064918188)
    (-0.231720960000 0.479543146359 0.020937305935)
    (-0.234375000000 0.499524110791 0.021809693683)
    (-0.236728960000 0.519505075223 0.022682081430)
    (-0.238806360000 0.539486039654 0.023554469177)
    (-0.240629760000 0.559467004086 0.024426856925)
    (-0.242220760000 0.579447968517 0.025299244672)
    (-0.243600000000 0.599428932949 0.026171632419)
    (-0.244787160000 0.619409897381 0.027044020167)
    (-0.245800960000 0.639390861812 0.027916407914)
    (-0.246659160000 0.659371826244 0.028788795661)
    (-0.247378560000 0.679352790676 0.029661183408)
    (-0.247975000000 0.699333755107 0.030533571156)
    (-0.248463360000 0.719314719539 0.031405958903)
    (-0.248857560000 0.739295683971 0.032278346650)
    (-0.249170560000 0.759276648402 0.033150734398)
    (-0.249414360000 0.779257612834 0.034023122145)
    (-0.249600000000 0.799238577265 0.034895509892)
    (-0.249737560000 0.819219541697 0.035767897640)
    (-0.249836160000 0.839200506129 0.036640285387)
    (-0.249903960000 0.859181470560 0.037512673134)
    (-0.249948160000 0.879162434992 0.038385060881)
    (-0.249975000000 0.899143399424 0.039257448629)
    (-0.249989760000 0.919124363855 0.040129836376)
    (-0.249996760000 0.939105328287 0.041002224123)
    (-0.249999360000 0.959086292719 0.041874611871)
    (-0.249999960000 0.979067257150 0.042746999618)
    )
    spline 1 2
    (
    (-0.019407960000 0.019980964432 -0.000872387747)
    (-0.037663360000 0.039961928863 -0.001744775495)
    (-0.054812760000 0.059942893295 -0.002617163242)
    (-0.070901760000 0.079923857727 -0.003489550989)
    (-0.085975000000 0.099904822158 -0.004361938737)
    (-0.100076160000 0.119885786590 -0.005234326484)
    (-0.113247960000 0.139866751021 -0.006106714231)
    (-0.125532160000 0.159847715453 -0.006979101978)
    (-0.136969560000 0.179828679885 -0.007851489726)
    (-0.147600000000 0.199809644316 -0.008723877473)
    (-0.157462360000 0.219790608748 -0.009596265220)
    (-0.166594560000 0.239771573180 -0.010468652968)
    (-0.175033560000 0.259752537611 -0.011341040715)
    (-0.182815360000 0.279733502043 -0.012213428462)
    (-0.189975000000 0.299714466475 -0.013085816210)
    (-0.196546560000 0.319695430906 -0.013958203957)
    (-0.202563160000 0.339676395338 -0.014830591704)
    (-0.208056960000 0.359657359769 -0.015702979452)
    (-0.213059160000 0.379638324201 -0.016575367199)
    (-0.217600000000 0.399619288633 -0.017447754946)
    (-0.221708760000 0.419600253064 -0.018320142693)
    (-0.225413760000 0.439581217496 -0.019192530441)
    (-0.228742360000 0.459562181928 -0.020064918188)
    (-0.231720960000 0.479543146359 -0.020937305935)
    (-0.234375000000 0.499524110791 -0.021809693683)
    (-0.236728960000 0.519505075223 -0.022682081430)
    (-0.238806360000 0.539486039654 -0.023554469177)
    (-0.240629760000 0.559467004086 -0.024426856925)
    (-0.242220760000 0.579447968517 -0.025299244672)
    (-0.243600000000 0.599428932949 -0.026171632419)
    (-0.244787160000 0.619409897381 -0.027044020167)
    (-0.245800960000 0.639390861812 -0.027916407914)
    (-0.246659160000 0.659371826244 -0.028788795661)
    (-0.247378560000 0.679352790676 -0.029661183408)
    (-0.247975000000 0.699333755107 -0.030533571156)
    (-0.248463360000 0.719314719539 -0.031405958903)
    (-0.248857560000 0.739295683971 -0.032278346650)
    (-0.249170560000 0.759276648402 -0.033150734398)
    (-0.249414360000 0.779257612834 -0.034023122145)
    (-0.249600000000 0.799238577265 -0.034895509892)
    (-0.249737560000 0.819219541697 -0.035767897640)
    (-0.249836160000 0.839200506129 -0.036640285387)
    (-0.249903960000 0.859181470560 -0.037512673134)
    (-0.249948160000 0.879162434992 -0.038385060881)
    (-0.249975000000 0.899143399424 -0.039257448629)
    (-0.249989760000 0.919124363855 -0.040129836376)
    (-0.249996760000 0.939105328287 -0.041002224123)
    (-0.249999360000 0.959086292719 -0.041874611871)
    (-0.249999960000 0.979067257150 -0.042746999618)
    )
    BSpline 1 8
    (
    (0.013333333333 0.047036678494 0.002053665734)
    (0.066666666667 0.104648678506 0.004569059978)
    (0.120000000000 0.139688235632 0.006098920081)
    (0.173333333333 0.167023414244 0.007292399754)
    (0.226666666667 0.190008944813 0.008295969692)
    (0.280000000000 0.210077456629 0.009172179840)
    (0.333333333333 0.228000519582 0.009954717669)
    (0.386666666667 0.244250888528 0.010664224099)
    (0.440000000000 0.259143428693 0.011314446445)
    (0.493333333333 0.272900526190 0.011915094294)
    (0.546666666667 0.285686258377 0.012473331417)
    (0.600000000000 0.297625838475 0.012994624742)
    (0.653333333333 0.308817424543 0.013483259942)
    (0.706666666667 0.319339668920 0.013942671053)
    (0.760000000000 0.329256749456 0.014375660140)
    (0.813333333333 0.338621839889 0.014784548819)
    (0.866666666667 0.347479573944 0.015171285840)
    (0.920000000000 0.355867838724 0.015537525390)
    (0.973333333333 0.363819108128 0.015884685309)
    (1.026666666667 0.371361452916 0.016213991194)
    (1.080000000000 0.378519318471 0.016526510354)
    (1.133333333333 0.385314132456 0.016823178339)
    (1.186666666667 0.391764785754 0.017104819944)
    (1.240000000000 0.397888017556 0.017372166018)
    (1.293333333333 0.403698726953 0.017625867070)
    (1.346666666667 0.409210227442 0.017866504378)
    (1.400000000000 0.414434456597 0.018094599149)
    (1.453333333333 0.419382150142 0.018310620114)
    (1.506666666667 0.424062987505 0.018514989887)
    (1.560000000000 0.428485714297 0.018708090309)
    (1.613333333333 0.432658245979 0.018890266977)
    (1.666666666667 0.436587756060 0.019061833092)
    (1.720000000000 0.440280751499 0.019223072755)
    (1.773333333333 0.443743137424 0.019374243789)
    (1.826666666667 0.446980272890 0.019515580176)
    (1.880000000000 0.449997019063 0.019647294158)
    (1.933333333333 0.452797780968 0.019769578064)
    (1.986666666667 0.455386543725 0.019882605887)
    (2.040000000000 0.457766904038 0.019986534663)
    (2.093333333333 0.459942097584 0.020081505664)
    (2.146666666667 0.461915022812 0.020167645440)
    (2.200000000000 0.463688261594 0.020245066717)
    (2.253333333333 0.465264097102 0.020313869181)
    (2.306666666667 0.466644529203 0.020374140148)
    (2.360000000000 0.467831287635 0.020425955140)
    (2.413333333333 0.468825843161 0.020469378372)
    (2.466666666667 0.469629416895 0.020504463159)
    (2.520000000000 0.470242987913 0.020531252248)
    (2.573333333333 0.470667299290 0.020549778083)
    (2.626666666667 0.470902862628 0.020560063001)
    )
    BSpline 1 6
    (
    (0.013333333333 0.047036678494 -0.002053665734)
    (0.066666666667 0.104648678506 -0.004569059978)
    (0.120000000000 0.139688235632 -0.006098920081)
    (0.173333333333 0.167023414244 -0.007292399754)
    (0.226666666667 0.190008944813 -0.008295969692)
    (0.280000000000 0.210077456629 -0.009172179840)
    (0.333333333333 0.228000519582 -0.009954717669)
    (0.386666666667 0.244250888528 -0.010664224099)
    (0.440000000000 0.259143428693 -0.011314446445)
    (0.493333333333 0.272900526190 -0.011915094294)
    (0.546666666667 0.285686258377 -0.012473331417)
    (0.600000000000 0.297625838475 -0.012994624742)
    (0.653333333333 0.308817424543 -0.013483259942)
    (0.706666666667 0.319339668920 -0.013942671053)
    (0.760000000000 0.329256749456 -0.014375660140)
    (0.813333333333 0.338621839889 -0.014784548819)
    (0.866666666667 0.347479573944 -0.015171285840)
    (0.920000000000 0.355867838724 -0.015537525390)
    (0.973333333333 0.363819108128 -0.015884685309)
    (1.026666666667 0.371361452916 -0.016213991194)
    (1.080000000000 0.378519318471 -0.016526510354)
    (1.133333333333 0.385314132456 -0.016823178339)
    (1.186666666667 0.391764785754 -0.017104819944)
    (1.240000000000 0.397888017556 -0.017372166018)
    (1.293333333333 0.403698726953 -0.017625867070)
    (1.346666666667 0.409210227442 -0.017866504378)
    (1.400000000000 0.414434456597 -0.018094599149)
    (1.453333333333 0.419382150142 -0.018310620114)
    (1.506666666667 0.424062987505 -0.018514989887)
    (1.560000000000 0.428485714297 -0.018708090309)
    (1.613333333333 0.432658245979 -0.018890266977)
    (1.666666666667 0.436587756060 -0.019061833092)
    (1.720000000000 0.440280751499 -0.019223072755)
    (1.773333333333 0.443743137424 -0.019374243789)
    (1.826666666667 0.446980272890 -0.019515580176)
    (1.880000000000 0.449997019063 -0.019647294158)
    (1.933333333333 0.452797780968 -0.019769578064)
    (1.986666666667 0.455386543725 -0.019882605887)
    (2.040000000000 0.457766904038 -0.019986534663)
    (2.093333333333 0.459942097584 -0.020081505664)
    (2.146666666667 0.461915022812 -0.020167645440)
    (2.200000000000 0.463688261594 -0.020245066717)
    (2.253333333333 0.465264097102 -0.020313869181)
    (2.306666666667 0.466644529203 -0.020374140148)
    (2.360000000000 0.467831287635 -0.020425955140)
    (2.413333333333 0.468825843161 -0.020469378372)
    (2.466666666667 0.469629416895 -0.020504463159)
    (2.520000000000 0.470242987913 -0.020531252248)
    (2.573333333333 0.470667299290 -0.020549778083)
    (2.626666666667 0.470902862628 -0.020560063001)
    )
    spline 14 16
    (
    (12.674429850667 0.019980964432 0.000872387747)
    (12.681732010667 0.039961928863 0.001744775495)
    (12.688591770667 0.059942893295 0.002617163242)
    (12.695027370667 0.079923857727 0.003489550989)
    (12.701056666667 0.099904822158 0.004361938737)
    (12.706697130667 0.119885786590 0.005234326484)
    (12.711965850667 0.139866751021 0.006106714231)
    (12.716879530667 0.159847715453 0.006979101978)
    (12.721454490667 0.179828679885 0.007851489726)
    (12.725706666667 0.199809644316 0.008723877473)
    (12.729651610667 0.219790608748 0.009596265220)
    (12.733304490667 0.239771573180 0.010468652968)
    (12.736680090667 0.259752537611 0.011341040715)
    (12.739792810667 0.279733502043 0.012213428462)
    (12.742656666667 0.299714466475 0.013085816210)
    (12.745285290667 0.319695430906 0.013958203957)
    (12.747691930667 0.339676395338 0.014830591704)
    (12.749889450667 0.359657359769 0.015702979452)
    (12.751890330667 0.379638324201 0.016575367199)
    (12.753706666667 0.399619288633 0.017447754946)
    (12.755350170667 0.419600253064 0.018320142693)
    (12.756832170667 0.439581217496 0.019192530441)
    (12.758163610667 0.459562181928 0.020064918188)
    (12.759355050667 0.479543146359 0.020937305935)
    (12.760416666667 0.499524110791 0.021809693683)
    (12.761358250667 0.519505075223 0.022682081430)
    (12.762189210667 0.539486039654 0.023554469177)
    (12.762918570667 0.559467004086 0.024426856925)
    (12.763554970667 0.579447968517 0.025299244672)
    (12.764106666667 0.599428932949 0.026171632419)
    (12.764581530667 0.619409897381 0.027044020167)
    (12.764987050667 0.639390861812 0.027916407914)
    (12.765330330667 0.659371826244 0.028788795661)
    (12.765618090667 0.679352790676 0.029661183408)
    (12.765856666667 0.699333755107 0.030533571156)
    (12.766052010667 0.719314719539 0.031405958903)
    (12.766209690667 0.739295683971 0.032278346650)
    (12.766334890667 0.759276648402 0.033150734398)
    (12.766432410667 0.779257612834 0.034023122145)
    (12.766506666667 0.799238577265 0.034895509892)
    (12.766561690667 0.819219541697 0.035767897640)
    (12.766601130667 0.839200506129 0.036640285387)
    (12.766628250667 0.859181470560 0.037512673134)
    (12.766645930667 0.879162434992 0.038385060881)
    (12.766656666667 0.899143399424 0.039257448629)
    (12.766662570667 0.919124363855 0.040129836376)
    (12.766665370667 0.939105328287 0.041002224123)
    (12.766666410667 0.959086292719 0.041874611871)
    (12.766666650667 0.979067257150 0.042746999618)
    )
    spline 14 15
    (
    (12.674429850667 0.019980964432 -0.000872387747)
    (12.681732010667 0.039961928863 -0.001744775495)
    (12.688591770667 0.059942893295 -0.002617163242)
    (12.695027370667 0.079923857727 -0.003489550989)
    (12.701056666667 0.099904822158 -0.004361938737)
    (12.706697130667 0.119885786590 -0.005234326484)
    (12.711965850667 0.139866751021 -0.006106714231)
    (12.716879530667 0.159847715453 -0.006979101978)
    (12.721454490667 0.179828679885 -0.007851489726)
    (12.725706666667 0.199809644316 -0.008723877473)
    (12.729651610667 0.219790608748 -0.009596265220)
    (12.733304490667 0.239771573180 -0.010468652968)
    (12.736680090667 0.259752537611 -0.011341040715)
    (12.739792810667 0.279733502043 -0.012213428462)
    (12.742656666667 0.299714466475 -0.013085816210)
    (12.745285290667 0.319695430906 -0.013958203957)
    (12.747691930667 0.339676395338 -0.014830591704)
    (12.749889450667 0.359657359769 -0.015702979452)
    (12.751890330667 0.379638324201 -0.016575367199)
    (12.753706666667 0.399619288633 -0.017447754946)
    (12.755350170667 0.419600253064 -0.018320142693)
    (12.756832170667 0.439581217496 -0.019192530441)
    (12.758163610667 0.459562181928 -0.020064918188)
    (12.759355050667 0.479543146359 -0.020937305935)
    (12.760416666667 0.499524110791 -0.021809693683)
    (12.761358250667 0.519505075223 -0.022682081430)
    (12.762189210667 0.539486039654 -0.023554469177)
    (12.762918570667 0.559467004086 -0.024426856925)
    (12.763554970667 0.579447968517 -0.025299244672)
    (12.764106666667 0.599428932949 -0.026171632419)
    (12.764581530667 0.619409897381 -0.027044020167)
    (12.764987050667 0.639390861812 -0.027916407914)
    (12.765330330667 0.659371826244 -0.028788795661)
    (12.765618090667 0.679352790676 -0.029661183408)
    (12.765856666667 0.699333755107 -0.030533571156)
    (12.766052010667 0.719314719539 -0.031405958903)
    (12.766209690667 0.739295683971 -0.032278346650)
    (12.766334890667 0.759276648402 -0.033150734398)
    (12.766432410667 0.779257612834 -0.034023122145)
    (12.766506666667 0.799238577265 -0.034895509892)
    (12.766561690667 0.819219541697 -0.035767897640)
    (12.766601130667 0.839200506129 -0.036640285387)
    (12.766628250667 0.859181470560 -0.037512673134)
    (12.766645930667 0.879162434992 -0.038385060881)
    (12.766656666667 0.899143399424 -0.039257448629)
    (12.766662570667 0.919124363855 -0.040129836376)
    (12.766665370667 0.939105328287 -0.041002224123)
    (12.766666410667 0.959086292719 -0.041874611871)
    (12.766666650667 0.979067257150 -0.042746999618)
    )
    spline 12 14
    (
    (10.133333333333 0.470952904668 0.020562247883)
    (10.266666666667 0.470908752557 0.020560320161)
    (10.400000000000 0.470717426744 0.020551966695)
    (10.533333333333 0.470202318785 0.020529476596)
    (10.666666666667 0.469116176860 0.020482054615)
    (10.800000000000 0.467141105772 0.020395821149)
    (10.933333333333 0.463888566946 0.020253812237)
    (11.066666666667 0.458899378429 0.020035979562)
    (11.200000000000 0.451643714894 0.019719190451)
    (11.333333333333 0.441521107633 0.019277227873)
    (11.466666666667 0.427860444563 0.018680790443)
    (11.600000000000 0.409919970223 0.017897492417)
    (11.733333333333 0.386887285775 0.016891863696)
    (11.866666666667 0.357879349003 0.015625349825)
    (12.000000000000 0.321942474316 0.014056311991)
    (12.133333333333 0.278052332743 0.012140027025)
    (12.266666666667 0.225113951938 0.009828687403)
    (12.400000000000 0.161961716176 0.007071401243)
    (12.533333333333 0.087359366356 0.003814192307)
    )
    spline 10 14
    (
    (10.133333333333 0.470952904668 -0.020562247883)
    (10.266666666667 0.470908752557 -0.020560320161)
    (10.400000000000 0.470717426744 -0.020551966695)
    (10.533333333333 0.470202318785 -0.020529476596)
    (10.666666666667 0.469116176860 -0.020482054615)
    (10.800000000000 0.467141105772 -0.020395821149)
    (10.933333333333 0.463888566946 -0.020253812237)
    (11.066666666667 0.458899378429 -0.020035979562)
    (11.200000000000 0.451643714894 -0.019719190451)
    (11.333333333333 0.441521107633 -0.019277227873)
    (11.466666666667 0.427860444563 -0.018680790443)
    (11.600000000000 0.409919970223 -0.017897492417)
    (11.733333333333 0.386887285775 -0.016891863696)
    (11.866666666667 0.357879349003 -0.015625349825)
    (12.000000000000 0.321942474316 -0.014056311991)
    (12.133333333333 0.278052332743 -0.012140027025)
    (12.266666666667 0.225113951938 -0.009828687403)
    (12.400000000000 0.161961716176 -0.007071401243)
    (12.533333333333 0.087359366356 -0.003814192307)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 3 0 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (18 19 17 17)
        );
    }
    wedge0
    {
        type wedge;
        faces
        (
            (0 1 4 5)
            (1 8 9 4)
            (8 12 13 9)
            (12 14 16 13)
            (14 17 19 16)
        );
    }
    wedge1
    {
        type wedge;
        faces
        (
            (3 2 1 0)
            (2 7 6 1)
            (7 11 10 6)
            (11 15 14 10)
            (15 18 17 14)
        );
    }
    pipe
    {
        type wall;
        faces
        (
            (5 4 2 3)
            (4 9 7 2)
            (9 13 11 7)
            (13 16 15 11)
            (16 19 18 15)
        );
    }
    BoR
    {
        type wall;
        faces
        (
            (1 6 8 1)
            (6 10 12 8)
            (10 14 14 12)
        );
    }
);